const errText = {
  incorrectData: 'Вы ввели неправильный логин или пароль.',
  conflicrEmail: 'Пользователь с таким email уже существует.',
  registerError: 'При регистрации пользователя произошла ошибка',
  patchUserError: 'При обновлении профиля произошла ошибка.',
  tokenError: ' При авторизации произошла ошибка. Токен не передан или передан не в том формате.',
  serverError: 'На сервере произошла ошибка.',
  notFoundError: ' Страница по указанному маршруту не найдена.',
};

export default errText;
